
<?php
	//ex 1.1
    // $x = 7;
    // $y = 5;
    
    // echo $x*$y."<br/>";
    // echo $x+$y;

//========================================================//

	//ex 1.2
    // $a = 4;
    // $b = 6;
    // $c = $a*$a+$b*$b;
    
    // echo "a = ".$a.", b = ".$b."<br/>";
    // echo "c = a<sup>2</sup> + b<sup>2</sup> <br/>";
    // echo "c = ".$c;

//========================================================//

	//ex 1.3

	/*$x = 3;
    $y = 5;
    $z = 8;
    $m = floor(($x+$y+$z)/3);
    
    echo "m = ($x+$y+$z)/3 = $m";*/  

//========================================================//

	//ex 1.4

	/*$x = 2;
    $y = 6; 
    $z = 9;
    $a = ($x+1)*4-2*($z-2*$x*$x+$y*$y);
    
    echo $a;*/

//========================================================//

	//ex 1.5

	/*$a = 4; 
    $b = 8; 
    $c = 3;
    
    echo "($a+$b)/$c = ".($a+$b)/$c."<br/>";
    echo "($a+$c)/$b = ".($a+$c)/$b."<br/>";
    echo "($c+$b)/$a = ".($c+$b)/$a;*/

//========================================================//

    //ex 1.6

    /*$x = 123;
    $var = $x%100;
    $unit = $x%10;
    $doz = ($var - $unit)/10;
    $hund = ($x-$var)/100;
    $sum = $hund + $doz + $unit;
    
    echo "x = $x<br/>";
    echo "$hund + $doz + $unit = $sum";*/

//========================================================//

	//ex 2.1    

    /*$a = 15;
    echo "a1 = $a <br/>";
    
    if($a>10)
    {
        $a += 100;
    }
    else
    {
        $a -= 30;
    }
    echo "a2 = $a <br/>";*/

//========================================================//

    //ex 2.2

    /*$a = 8;
    echo "a1 = $a <br/>";
    
    if($a%2 == 0)
    {
        $a /= 2;
    }
    else
    {
        $a *= 3;
    }
    echo "a2 = $a <br/>";*/

//========================================================//

    //ex 2.3

    /*$a = 24;
    echo "a1 = $a <br/>";
    if($a>50)
    {
       echo "$a<sup>2</sup> = ".$a*$a;
    }
    else if($a>10 && $a<30)
    {
       echo 0;
    }
    else
    {
       echo "Ошибка";
    }*/

//========================================================//

    //ex 2.4

    /*$a = 15;
    $b = 4;
    
    if($a>$b)
    {
        echo $a;
    }
    else
    {
        echo $b;
    }*/

//========================================================//

    //ex 2.5

    /*$a = 19;
    $b = 143;
    
    if(($a-$b == 100) || ($b-$a == 100))
    {
        echo "Да";
    }
    else
    {
        echo "Нет";
    }*/

//========================================================//

	//ex 2.6

    /*$a = 67;
    $b = 83;
    
    if($a>$b && ($a-$b <= 20))
    {
        echo "Да";
    }
    else if($b>$a && ($b-$a <= 20))
    {
        echo "Да";
    }
    else
    {
        echo "Нет";
    }*/

//========================================================//

    //ex 2.7

    /*$num = 123;
    echo "number = $num <br/>";
    $var = $num%100;
    $unit = $num%10;
    $doz = ($var - $unit)/10;
    $hund = ($num-$var)/100;
    
    $nums = array($hund.$unit.$doz,$doz.$hund.$unit,$unit.$hund.$doz,$unit.$doz.$hund);
    foreach($nums as $n) 
    {
        $max = $nums[0];
        if($n>$max)
        {
            $max = $n;
        }
    }
    echo "max = ".$max;*/

//========================================================//

	//ex 2.8

	/*$day = 2;
    
    switch($day)
    {
        case(1):
        {
            echo "Понедельник";
            break;
        }
        case(2):
        {
            echo "Вторник";
            break;
        }
        case(3):
        {
            echo "Среда";
            break;
        }
        case(4):
        {
            echo "Четверг";
            break;
        }
        case(5):
        {
            echo "Пятница";
            break;
        }
        case(6):
        {
            echo "Суббота";
            break;
        }
        case(7):
        {
            echo "Воскресенье";
            break;
        }
        default:
        {
            echo "Некорректный формат ввода";
        }
    }*/

//========================================================//

	//ex 2.9

	/*$age = 83;
    
    if($age>80)
    {
       echo "Здравствуйте, уважаемый";
    }
    else
    {
        echo "Успехов!";
    }*/

//========================================================//

	//ex 3.1

	/*$arr = array("Привет,","мир","!");
    echo "$arr[0] $arr[1]$arr[2]";*/

 //========================================================//

    //ex 3.2

    /*$arr = array("Привет, ","мир","!");
    $text = $arr[0].$arr[1].$arr[2];
    echo $text;*/

//========================================================//

    //ex 3.3

    /*$arr = array("Привет,","мир","!");
    $arr[0] = "Пока, ";
    echo "$arr[0] $arr[1]$arr[2]";*/

//========================================================//

    //ex 3.4

    /*$nums = array(1,"",2,"",3);
    echo "arr1: ".implode(", ",$nums);
    for($i=0;$i<count($nums);$i++)
    {
        if($key = array_search("",$nums))
        {
            unset($nums[$key]);
            $i--;
        }
    }
    $nums = implode(", ",$nums);
    echo "<br/>arr2: ".$nums;*/

//========================================================//

    //ex 3.5

    /*$arr = array("Коля"=>"1000$", "Вася" => "500$", "Петя" => "200$");
    echo $arr['Коля'];*/ 

//========================================================//

    //ex 3.6

    /*$arr = [1, 2, 3, 4, 5];

	$arr2[] = 1;
	$arr2[] = 2;
	$arr2[] = 3;
	$arr2[] = 4;
	$arr2[] = 5;

	echo implode(", ", $arr)."<br>";
	echo implode(", ", $arr2);*/

//========================================================//

	//ex 3.7

	/*$arr = array("a"=>"1", "b" => "2", "c" => "3");
	echo $arr['b'];*/
	
//========================================================//

	//ex 3.8

	/*$arr = ['a'=>1, 'b'=>2, 'c'=>3];
    $sum = 0;
    
    foreach($arr as $key)
    {
        $sum += $key;
    }
    echo $sum;*/

 //========================================================//
 
 	//ex 3.9

 	/*$arr = ['1'=> 'понедельник', '2'=> 'вторник', '3'=>'среда', '4'=>'четверг', '5'=>'пятница', '6'=>'суббота', '7'=>'воскресенье'];
    echo $arr['4'];*/

 //========================================================//
    
    //ex 3.10

    /*$arr = ['1'=> 'понедельник', '2'=> 'вторник', '3'=>'среда', '4'=>'четверг', '5'=>'пятница', '6'=>'суббота', '7'=>'воскресенье'];
    $day = $arr['3'];
    echo $day;*/  

//========================================================//
  
  	//ex 4.1

  	/*$arr = [
		'sp'=>['azul', 'rojo', 'verde'], 
		'en'=>['blue', 'red', 'green']];
    echo $arr['sp'][0];*/

//========================================================//

    //ex 4.2

    /*$arr=['a', 'b', 'c'];
    var_dump($arr);
    
    $arr2 = [
'sp'=>['azul', 'rojo', 'verde'], 'en'=>['blue', 'red', 'green']];
    
    echo "<br>".$arr2['sp'][0]."<br>";
    echo $arr2['sp'][1]."<br>";
    echo $arr2['sp'][2]."<br>";*/

//========================================================//

    //ex 4.3

    /*$mas = array(2,8,5,3);
    $a = $mas[0]*$mas[1]+$mas[2]*$mas[3];
    echo "$mas[0]*$mas[1]+$mas[2]*$mas[3] = ".$a;*/

//========================================================//

	//ex 4.4 
	
	/*for($i=0;$i<5;$i++)
    {
        $arr[$i] = $i+1;
    }
    
    echo implode(", ",$arr);*/

//========================================================//

    //ex 4.5

    /*$arr = [
'cms'=>['joomla', 'wordpress', 'drupal'],
'colors'=>['blue'=>'голубой', 'red'=>'красный', 'green'=>'зеленый']
];
    echo $arr['cms'][0]."<br>";
    echo $arr['cms'][2]."<br>";
    //rojo
    echo $arr['cms'][1][2].$arr['cms'][1][1].$arr['cms'][0][0].$arr['cms'][0][1];*/
   
//========================================================//

    //ex 4.6

   /*$arr = [
    'ru'=>[1=> 'понедельник', 2=> 'вторник', 3=>'среда', 4=>'четверг', 5=>'пятница', 6=>'суббота', 7=>'воскресенье'],
    'en'=>[1=> 'monday', 2=> 'tuesday', 3=>'wednesday', 4=>'thursday', 5=>'friday', 6=>'saturday', 7=>'sunday']];
    echo $arr['ru'][1]."<br>";
    echo $arr['en'][3];*/

//========================================================//

    //ex 4.7

    /*$arr = [
    'ru'=>[1=> 'понедельник', 2=> 'вторник', 3=>'среда', 4=>'четверг', 5=>'пятница', 6=>'суббота', 7=>'воскресенье'],
    'en'=>[1=> 'monday', 2=> 'tuesday', 3=>'wednesday', 4=>'thursday', 5=>'friday', 6=>'saturday', 7=>'sunday']];
    $lang = 'ru';
    $day = 3;
    echo $arr[$lang][$day];*/

//========================================================//
 	
    //ex 7.1

    /*$str = "php";
    echo strtoupper($str);*/

//========================================================//
 
    //ex 7.2

    /*$str = "PHP";
    echo strtolower($str);*/

//========================================================//

    //ex 7.3

    /*$str = "london";
    echo ucfirst($str);*/

//========================================================//
  
    //ex 7.4

    /*$str = "London";
    echo lcfirst($str);*/

//========================================================//
 
    //ex 7.5

    /*$str = "london is the capital of great britain";
    echo ucwords($str);
    echo "<br> <br>";*/

//========================================================//
 
    //ex 7.6

    /*$str = "LONDON";
    $str = strtolower($str);
    echo ucfirst($str);*/

//========================================================//
 
    //ex 7.7

    /*$str = "html css php";
    echo strlen($str);*/

//========================================================//
     
    //ex 7.8

    /*$password = "qwerty";
    echo "Password: $password <br>";

     if(strlen($password) > 5 && strlen($password) < 10)
     {
         echo "Password is correct";
     }
     else
     {
         echo "Create another password";
     }*/

//========================================================//
 
    //ex 7.9

    /*$str = "html css php";

    echo substr($str, 0,4)."<br>";
    echo substr($str, 5,3)."<br>"; 
    echo substr($str, 9)."<br>";*/

//========================================================// 

    //ex 7.10

    /*$str = "qwertyuiop"; 
    echo substr($str, strlen($str)-3);*/

//========================================================//
 
    //ex 7.11

    /*$str = "http://qwertyuiop.com";

    echo "$str <br>";

    if (substr($str, 0,7) == "http://")
    {
        echo "Да";
    }
    else
    {
        echo "Нет";
    }*/

//========================================================//
 
    //ex 7.12

    /*$str = "https://qwertyuiop.com";

    echo "$str <br>";

    if (substr($str, 0,7) == "http://" || substr($str, 0,8) == "https://")
    {
        echo "Да";
    }
    else
    {
        echo "Нет";
    }*/

//========================================================//
 
    //ex 7.13

    /*$str = "qwerty.png";

    echo "$str <br>";

    if (substr($str, strlen($str)-4) == ".png")
    {
        echo "Да";
    }
    else
    {
        echo "Нет";
    }*/

//========================================================//
 
    //ex 7.14

    /*$str = "qwerty.jpg";

    echo "$str <br>";

    if (substr($str, strlen($str)-4) == ".png" || substr($str, strlen($str)-4) == ".jpg")
    {
        echo "Да";
    }
    else
    {
        echo "Нет";
    }*/

//========================================================//
     
    //ex 7.15

    /*$sym = "Lorem ipsum";
    if(strlen($sym) > 5)
    {
        echo substr($sym,0,5)."...";
    }
    else
    {
        echo $sym;
    }*/

//========================================================//
     
    //ex 7.16

    /*$date = "31.12.2013";
    echo str_replace(".", "-", $date);*/

//========================================================//
 
    //ex 7.17

    /*$str = "abracadabra";
    echo "$str <br>";
    $let = array("a","b","c");
    $nums = array("1","2","3");
    echo str_replace($let,$nums,$str);*/

//========================================================//
 
    //ex 7.18

    /*$str = "1a2b3c4b5d6e7f8g9h0";
    echo "$str <br>";
    $nums = array("1","2","3","4","5","6","7","8","9","0");
    
    echo str_replace($nums, "", $str);*/

//========================================================//
 
    //ex 7.19

    /*$str = "abracadabra";
    echo "$str <br>";
    
    $change = array("a"=>"1","b"=>"2","c"=>"3");
    echo "1. ".strtr($str, $change)."<br>";

    echo "2. ".strtr($str,"abc","123");*/

//========================================================//
 
    //ex 7.20

//========================================================//
     
    //ex 7.21

    /*$word = "capability";
    echo "$word <br>";
    echo substr_replace($word, "!!!", 2,5);*/

//========================================================//
 
    //ex 7.22

    /*$str = "abc abc abc";
    echo strpos($str,"b");*/

//========================================================//
 
    //ex 7.23

    /*str = "abc abc abc";
    echo strrpos($str,"b");*/

//========================================================//
     
    //ex 7.24

    /*str = "abc abc abc";
    echo strpos($str,"b",3);*/

//========================================================//
     
    //ex 7.25

    /*$scream = "aa aa.. aa aa";
    echo "$scream <br>";
    //1
    echo strpos($scream," ",3)."<br>";*/
    
    //2
    // if(strpos($scream, ".", strpos($scream, ".")+1)-strpos($scream, ".") == 1)
    // {
    //      echo "Да"."<br>";
    // }	
  	// else
    // {
    //      echo "Нет"."<br>";
  	// }

  	/*if(strpos($scream, "..") != null)
    {
        echo "Да"."<br>";
    }	
  	else
  	{
        echo "Нет"."<br>";
  	}*/

//========================================================//

  	//ex 7.26

  	/*$str = "http://speedtest.net";

    echo "$str <br>";

    if (strpos($str,"http://") == 0)
    {
        echo "Да";
    }
    else
    {
        echo "Нет";
    }*/

//========================================================//

    //ex 7.27

    /*$str = "html css php";
    $mas = explode(" ", $str);*/

// 	echo implode(", ", $mas);

//========================================================//

    //ex 7.28

    /*$mas = array("html", "css", "php");
	echo implode(", ", $mas);*/

//========================================================//

	//7.29

	/*$date = "2016-12-31";
	echo $date."<br>";
	$arr = explode("-", $date);
	$date = $arr[2].".".$arr[1].".".$arr[0];
	echo $date."<br>";*/

//========================================================//

	//ex 7.30

	/*$nums = "1234567890";
	$arr = str_split($nums,2);
	echo implode(", ", $arr);*/

//========================================================//

	//ex 7.31

	/*$nums = "1234567890";
	$arr = str_split($nums,1);
	echo implode(", ", $arr);*/

//========================================================//

	//ex 7.32

	/*$nums = " 1234567890 ";
	$arr = str_split($nums,2);
	echo implode("-", $arr);*/

//========================================================//

	//ex 7.33			

	/*$nums = " 1234567890 ";
	echo $nums."<br>";
	echo trim($nums);*/

//========================================================//

	//ex 7.34

	/*$pl = "/php/";
	echo $pl."<br>";
	echo trim($pl, "/");*/

//========================================================//

	//ex 7.35

	/*$str = "слова слова слова.";
	echo rtrim($str, ".").".";	*/

//========================================================//

	//ex 7.36

	/*$range = "12345";
	echo strrev($range);*/

//========================================================//

	//ex 7.37

	/*$palind = "madam";

	if($palind == strrev($palind))
	{
		echo ucfirst($palind)." is a palindrome";
	}
	else 
	{
		echo ucfirst($palind)." isn't a palindrome";
	}*/

//========================================================//

	//ex 7.38

	/*$str = "ordered string";
	echo str_shuffle($str);*/

//========================================================//

	//ex 7.39

	/*$alphabet = "abcdefghijklmnopqrstuvwxyz";
	$mix = str_shuffle($alphabet);
	$str = substr($mix,0,6);
	echo $str;*/

//========================================================//

	//ex 7.40

	/*$flat = "x";
	for($i = 1; $i < 10; $i++)
	{
		echo str_repeat($flat, $i)."<br>";
	}*/

//========================================================//

	//ex 7.41

	/*for($i = 2; $i < 10; $i++)
	{
		echo str_repeat($i, $i)."<br>";
	}*/

//========================================================//

	//ex 7.43

	/*$text = "html, <b>php</b>, js";
	echo strip_tags($text);*/

//========================================================//

	//ex 7.44

	/*$pls = "<i>c#</i>, <b>php</b>, <del>js</del>, <em>python</em>";
	echo strip_tags($pls, "<b><i>");*/

//========================================================//

	//ex 7.45

	/*$text = "html, <b>php</b>, js";
	echo htmlspecialchars($text);*/

//========================================================//

	//ex 7.46

	/*$str = 'ab-cd-ef';
	echo strstr($str, '-');*/

//========================================================//

	//ex 8.1

	/*$str = "London Tokyo Moscow New-York Anapa";
	$cities = explode(" ", $str);
	sort($cities);
	echo implode(" ", $cities);*/

//========================================================//

	//ex 8.2

	/*$snake = "var_test_text";
	$elem = explode("_", $snake);
	for($i = 1; $i < count($elem); $i++)
	{
		$elem[$i] = ucfirst($elem[$i]);
	}
	$camel = implode("", $elem);
	echo $camel;*/

//========================================================//

	//ex 8.3

	/*$orig = "12345 67890";
	$mas = explode(" ", $orig);
	$rev = strrev($mas[0])." ".strrev($mas[1]);
	echo $rev;*/

//========================================================//

	//ex 8.4

	/*$nums = ['12','3','13','678','345','89','70','99','213','37'];
	for($i=0;$i<count($nums);$i++)
	{
		if(strpos($nums[$i], "3") !== false)
		{
			echo $nums[$i]." ";
		}
	}*/

//========================================================//

	//ex 8.5

	/*$nums = ['12','3','13','338','345','89','70','99','213','37'];
	$k = 0;
	for($i=0;$i<count($nums);$i++)
	{
		if(strpos($nums[$i], "3") !== false)
		{
			$k+=substr_count($nums[$i], "3");
		}
	}
	echo $k;*/

//========================================================//

	//ex 8.6

	$num= "12345678";
	$arr[0] = substr($num,0,2);
	$sum = $arr[0];
	$j = 1;
	for($i=2;$i<strlen($num);$i+=2)
	{
		$arr[$j] = substr($num,$i,2);
		$sum += $arr[$j];
		$j++;
	}
	echo $sum;

//========================================================//

	//ex 8.7

  	function replaceBlock($text,$input,$n)
  	{
    	$str = trim($text, "/");
    	$blocks = explode("/", $str);
    	$blocks[$n] = $input;
    	echo "/".implode("/", $blocks)."/";
  	}

  	replaceBlock("/aaa/222/we33/qqq/","hello",2);
	
?>



